In [1]:
import pandas as pd

In [6]:
s = pd.Series([100,290,40,199,176])

In [7]:
s

0    100
1    290
2     40
3    199
4    176
dtype: int64

In [8]:
type(s)

pandas.core.series.Series

In [9]:
s.axes

[RangeIndex(start=0, stop=5, step=1)]

In [10]:
s.size

5

# Merging two series

In [12]:
s1 = pd.Series([2,3,55,2,6,44])

In [13]:
s2 = pd.Series([42,32,34,2,1,4,42])

In [14]:
pd.concat([s1,s2])

0     2
1     3
2    55
3     2
4     6
5    44
0    42
1    32
2    34
3     2
4     1
5     4
6    42
dtype: int64

# Creating a DataFrame

In [16]:
names = {"Names":["Allen","Rob","Harold","Amy"],"Age":[21,11,13,15]}

In [19]:
names

{'Names': ['Allen', 'Rob', 'Harold', 'Amy'], 'Age': [21, 11, 13, 15]}

# Creating a DataFrame using a Dictionary

In [17]:
new_dic = pd.DataFrame(names)

In [18]:
new_dic["Age"]

0    21
1    11
2    13
3    15
Name: Age, dtype: int64

# Assigning column name

In [20]:
var = [10,30,20,89,48,40]

In [21]:
df = pd.DataFrame(var,columns = ["Variables"])

In [22]:
df

   Variables
0         10
1         30
2         20
3         89
4         48
5         40

# Creating DataFrames from Numpy

In [24]:
import numpy as np

In [25]:
arr = np.random.randint(10,size = (5,2))

In [26]:
arr

array([[4, 3],
       [2, 0],
       [9, 2],
       [3, 4],
       [6, 6]])

# Assigning column name

In [27]:
new_arr= pd.DataFrame(arr,columns = ["Var1","Var2"])

In [28]:
new_arr

   Var1  Var2
0     4     3
1     2     0
2     9     2
3     3     4
4     6     6

# DataFrame.axes attribute access a group of rows and columns by label(s) or a boolean array in the given DataFrame.

In [29]:
new_arr.axes

[RangeIndex(start=0, stop=5, step=1), Index(['Var1', 'Var2'], dtype='object')]

# Accessing the rows of the DataFrame

In [30]:
dfc = pd.DataFrame({"Name":["Josh","Rachel","Tim","Kate","Zach","Andrew"],"Age":[11,13,16,12,14,18],"Salary":[10000,23000,18000,3900000,19000,24000]})

In [31]:
dfc

     Name  Age   Salary
0    Josh   11    10000
1  Rachel   13    23000
2     Tim   16    18000
3    Kate   12  3900000
4    Zach   14    19000
5  Andrew   18    24000

In [32]:
dfc.Age

0    11
1    13
2    16
3    12
4    14
5    18
Name: Age, dtype: int64

In [33]:
dfc["Age"][3]

12

# Filtering

In [34]:
employees = pd.DataFrame({"Name":["Josh","Mike","Julia","Sergio"],
                          "Department":["IT","Human Resources","Finance","Supply Chain"],"Income":[4800,5200,6600,5700],
"Age":[24,28,33,41]})

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

In [35]:
employees

     Name       Department  Income  Age
0    Josh               IT    4800   24
1    Mike  Human Resources    5200   28
2   Julia          Finance    6600   33
3  Sergio     Supply Chain    5700   41

In [36]:
employees["Department"] == "IT"

0     True
1    False
2    False
3    False
Name: Department, dtype: bool

# We can also use the loc[] Operator and it gives us the flexibility to choose from between various Departments

In [38]:
employees.loc[employees["Department"] == "IT","Name"]

0    Josh
Name: Name, dtype: object

In [39]:
employees[(employees["Age"]>30) | (employees["Department"] == "HR")]

     Name    Department  Income  Age
2   Julia       Finance    6600   33
3  Sergio  Supply Chain    5700   41

# To get opposite of a filter use ~(Tilde) sign —

In [40]:
employees[~(employees["Age"]<35)]

     Name    Department  Income  Age
3  Sergio  Supply Chain    5700   41

# Filtering with Filter () Function

In [41]:
employees.filter(items=["Department","Name","Income"])

        Department    Name  Income
0               IT    Josh    4800
1  Human Resources    Mike    5200
2          Finance   Julia    6600
3     Supply Chain  Sergio    5700